'''
Ввести с клавиатуры строку.
Вывести эту же строку вертикально: по одному символу на строку консоли.
'''
some_text = input('Введите строку: ')
for letter in some_text:
    print (letter)