'''
Создать список из десяти целых чисел.
Вывести на экран каждое число, увеличенное на 1.
'''
for spisok in range(9):
    print(spisok + 1)